{"id":10987,"date":"2022-09-26T14:25:56","date_gmt":"2022-09-26T14:25:56","guid":{"rendered":"https:\/\/techladder.io\/?post_type=awsm_job_openings&#038;p=10987"},"modified":"2024-07-18T11:24:11","modified_gmt":"2024-07-18T11:24:11","slug":"associate-sales-director","status":"publish","type":"awsm_job_openings","link":"https:\/\/techladder.io\/careers\/associate-sales-director\/","title":{"rendered":"Associate Sales Director"},"content":{"rendered":"\n<p><strong>EXPERIENCE<\/strong><\/p>\n\n\n\n<p>6+ Years<\/p>\n\n\n\n<p><strong>POSITION OVERVIEW<\/strong><\/p>\n\n\n\n<p>As a Associate Sales Director at Tharav, you will play a pivotal role in driving our market penetration and revenue growth. Your expertise in pre-sales, coupled with a deep understanding of database technologies, analytics, and cloud solutions, will enable you to effectively articulate the value of Tharav&#8217;s products to a diverse range of customers. You&#8217;ll be at the forefront of connecting cutting-edge technology with real-world business applications, delivering tailored solutions that address our clients&#8217; most pressing data challenges<\/p>\n\n\n\n<p><strong>RESPONSIBILITIES<\/strong><\/p>\n\n\n\n<ul>\n<li>Lead marketing and sales strategies to achieve business targets. <\/li>\n\n\n\n<li>Deliver compelling presentations and demos to both technical and executive audiences, showcasing Tharav’s value proposition. <\/li>\n\n\n\n<li>Leverage your deep technical expertise in database management, ETL, analytics, and cloud technologies to understand customer needs and develop effective solutions. <\/li>\n\n\n\n<li>Utilize hands-on knowledge of SQL and SQL analytics to provide insights and support to potential clients. <\/li>\n\n\n\n<li>Build and maintain strong relationships with key decision-makers, understanding their business needs and how Tharav can solve their specific challenges. <\/li>\n\n\n\n<li>Collaborate with the product development team to provide feedback from the field and help shape future product offerings. <\/li>\n<\/ul>\n\n\n\n<p><strong>QUALIFICATIONS&nbsp;<\/strong><\/p>\n\n\n\n<ul>\n<li>7-8 years of industry experience, with a minimum of 3 years in a pre-sales role within the technology sector. <\/li>\n\n\n\n<li>Outstanding presentation skills, with the ability to communicate effectively with both technical and executive audiences. <\/li>\n\n\n\n<li>Broad experience with database and\/or data warehouse technology, ETL processes, analytics, and cloud-based solutions. <\/li>\n\n\n\n<li>Hands-on experience with SQL and analytics tools. <\/li>\n\n\n\n<li>Proven ability to link customer business needs with product solutions. <\/li>\n\n\n\n<li>University degree in Computer Science, Engineering, Mathematics, or a related field, or equivalent practical experience. <\/li>\n\n\n\n<li>Prior pre-sales experience in Snowflake, Databricks, Dremio, Harbrdata, Qubole, Starburst, AWS Redshift or Athena is a plsnus.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>EXPERIENCE 6+ Years POSITION OVERVIEW As a Associate Sales Director at Tharav, you will play a pivotal role in driving our market penetration and revenue growth. Your expertise in pre-sales, coupled with a deep understanding of database technologies, analytics, and cloud solutions, will enable you to effectively articulate the value of Tharav&#8217;s products to a [&hellip;]<\/p>\n","protected":false},"author":1,"template":"","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"_links":{"self":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/10987"}],"collection":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings"}],"about":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/types\/awsm_job_openings"}],"author":[{"embeddable":true,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/users\/1"}],"version-history":[{"count":3,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/10987\/revisions"}],"predecessor-version":[{"id":20522,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/10987\/revisions\/20522"}],"wp:attachment":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/media?parent=10987"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}