{"id":11379,"date":"2022-10-28T09:47:30","date_gmt":"2022-10-28T09:47:30","guid":{"rendered":"https:\/\/techladder.io\/?post_type=awsm_job_openings&#038;p=11379"},"modified":"2024-05-06T11:54:48","modified_gmt":"2024-05-06T11:54:48","slug":"gen-ai","status":"publish","type":"awsm_job_openings","link":"https:\/\/techladder.io\/careers\/gen-ai\/","title":{"rendered":"Gen AI"},"content":{"rendered":"\n<p>Exp required: 5+ years experience with AI\/ML (2+ years in Gen AI)    <\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Job Description:<\/strong><\/h2>\n\n\n\n<p>We are seeking a skilled General AI Engineer with at least 5 years of experience to join our dynamic team. The ideal candidate will have a strong background in artificial intelligence, machine learning, and deep learning techniques.  As a general AI engineer, you will play a crucial role in developing, implementing, and maintaining advanced AI systems that drive innovation and solve complex problems. You will collaborate with cross-functional teams to design and deploy AI solutions that enhance products and services, leveraging your expertise to push the boundaries of what AI can achieve.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Skills and Qualifications:<\/strong><\/h2>\n\n\n\n<ul>\n<li>Bachelor&#8217;s degree in Computer Science, Engineering, Mathematics, or related field; Master&#8217;s or Ph.D.         <\/li>\n\n\n\n<li>Proficiency in programming languages such as Python (preferred) or R.<\/li>\n\n\n\n<li>Strong understanding of neural networks, deep learning frameworks (TensorFlow, PyTorch), and other AI techniques.         <\/li>\n\n\n\n<li>Excellent problem-solving skills and ability to think critically about complex technical challenges.         <\/li>\n\n\n\n<li>Should have experience in accessing Hugging Face, TensorFlow Hub, Kaggle sites.         <\/li>\n\n\n\n<li>Experience with natural language processing (NLP), computer vision, or reinforcement learning is a plus.         <\/li>\n\n\n\n<li>Proven track record of delivering successful AI projects from conception to deployment.    <\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Roles and Responsibilities: <\/strong><\/h2>\n\n\n\n<ul>\n<li>Develop and implement cutting-edge AI algorithms and models to solve complex problems. <\/li>\n\n\n\n<li>Design, build, and deploy scalable AI systems that deliver value to the organization.<\/li>\n\n\n\n<li>Collaborate with cross-functional teams to gather requirements and understand business needs.<\/li>\n\n\n\n<li>Conduct research to stay up-to-date with the latest advancements in AI and machine learning.<\/li>\n\n\n\n<li>Optimize AI models for performance, scalability, and efficiency. <\/li>\n\n\n\n<li>Provide technical guidance and mentorship to junior team members. <\/li>\n\n\n\n<li>Work closely with product managers and stakeholders to define project goals and milestones. <\/li>\n\n\n\n<li>Evaluate and select appropriate tools and technologies for AI development and deployment. <\/li>\n\n\n\n<li>Participate in code reviews, testing, and debugging to ensure high-quality AI solutions.<\/li>\n\n\n\n<li>Stay informed about industry best practices and emerging trends in AI and machine learning. <\/li>\n\n\n\n<li>Communicate complex technical concepts to non-technical stakeholders.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Must-have skill sets:<\/strong> <\/h2>\n\n\n\n<ul>\n<li>Expertise in Python, Data Structures, and API Calls- Solid foundation for working with generative AI models and frameworks.         <\/li>\n\n\n\n<li>Strong Communication Skills (Documentation &amp; Presentations)- Ability to clearly document\/present complex technical concepts for both technical and non-technical audiences.         <\/li>\n\n\n\n<li>Effective Teamwork and Solo Work- Collaborate effectively on large projects while also possessing the ability to independently drive research and development efforts.         <\/li>\n\n\n\n<li>Data Mining and Text Processing- Extract valuable insights from various data sources to train and improve generative models.         <\/li>\n\n\n\n<li>Building RAG Pipelines (Highly Desired) &#8211; Demonstrated experience building retrieval-augmented generation pipelines, a key technique in generative AI.         <\/li>\n\n\n\n<li>Machine Learning (ML), Natural Language Processing (NLP), Generative Adversarial Networks (GANs), Transformers &amp; BERT flavors, Hugging Face Model Implementation and Fine-Tuning:         <\/li>\n\n\n\n<li>Solid understanding of these core concepts for generative AI development. <\/li>\n\n\n\n<li>Hands-on Experience with Vector Databases: Experience with Chroma DB, PineCone, Milvus, FAISS, Arango DB for data storage and retrieval relevant to generative AI projects. <\/li>\n\n\n\n<li>Collaboration- Ability to collaborate effectively with Business Analysts (BAs), Development Teams, and DevOps teams to bring generative AI solutions to life.<\/li>\n\n\n\n<li>Hands-on Experience of Embedded Models: Familiarity with deploying generative models on resource-constrained devices can be a significant asset.<\/li>\n\n\n\n<li>Ex: Open AI – Ada Embedding 002 model         <\/li>\n\n\n\n<li>Experience with POC Tools (Streamlit, Gradio) &#8211; Ability to rapidly prototype and showcase generative AI concepts.<\/li>\n\n\n\n<li>Cloud Experience (AWS Bedrock or similar)-Expertise in managing and deploying large-scale generative AI models on cloud platforms with basic knowledge such as EC2, ECS, ECR, S3, Sagemaker etc.<\/li>\n\n\n\n<li>Expertise in Specific LLMs (Any one deep knowledge in OpenAI, Jurassic-1 Jumbo, LLAMA, mistral, Mixtral, Gemma, Gemini Pro) &#8211; In-depth knowledge of a particular LLM may be required depending on the specific project focus.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Exp required: 5+ years experience with AI\/ML (2+ years in Gen AI)     Job Description: We are seeking a skilled General AI Engineer with at least 5 years of experience to join our dynamic team. The ideal candidate will have a strong background in artificial intelligence, machine learning, and deep learning techniques.  As a general AI engineer, [&hellip;]<\/p>\n","protected":false},"author":1,"template":"","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"_links":{"self":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/11379"}],"collection":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings"}],"about":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/types\/awsm_job_openings"}],"author":[{"embeddable":true,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/users\/1"}],"version-history":[{"count":2,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/11379\/revisions"}],"predecessor-version":[{"id":19652,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/11379\/revisions\/19652"}],"wp:attachment":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/media?parent=11379"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}