{"id":16019,"date":"2023-03-09T12:00:31","date_gmt":"2023-03-09T12:00:31","guid":{"rendered":"https:\/\/techladder.io\/?post_type=awsm_job_openings&#038;p=16019"},"modified":"2024-05-06T11:22:03","modified_gmt":"2024-05-06T11:22:03","slug":"business-analyst-2","status":"publish","type":"awsm_job_openings","link":"https:\/\/techladder.io\/careers\/business-analyst-2\/","title":{"rendered":"Business Analyst"},"content":{"rendered":"\n<p> Exp required: 5+ Years<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Job Description:<\/h2>\n\n\n\n<p>As a key member of the project delivery team, the business analyst is responsible for delivering consistent and accelerated value to clients. The role involves conducting process discovery, gathering detailed requirements, developing business requirements documents, and ensuring the solution aligns with client needs.&nbsp;<\/p>\n\n\n\n<p>The ideal candidate will have business analysis and scrum master experience, excellent communication skills, the ability to work in a <strong>dynamic and fast-paced environment<\/strong>, and a strong focus on delivering a great customer experience and nurturing a healthy working relationship with the client.  <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Business Analyst Roles &amp; Responsibilities:<\/h2>\n\n\n\n<ul>\n<li>Understand the client&#8217;s business processes and conduct discovery sessions to analyze and document current business processes.&nbsp;<\/li>\n\n\n\n<li>Facilitate virtual meetings and workshops to gather and validate detailed client requirements, analyse use cases, and develop functional requirements.&nbsp;<\/li>\n\n\n\n<li>Analyze information from various sources to assess system changes needed for new projects and enhancements in existing applications.&nbsp;<\/li>\n\n\n\n<li>Develop clear and concise business requirements, use cases, and functional specification documents.&nbsp;<\/li>\n\n\n\n<li>Collaborate closely with internal stakeholders and the project delivery team to ensure successful project delivery.&nbsp;<\/li>\n\n\n\n<li>Perform checks to ensure the implemented solution aligns with business needs.&nbsp;<\/li>\n\n\n\n<li>Act as a single point of contact (SPOC) or bridge for business requirements between development and technical team members and business users and end users.&nbsp;<\/li>\n\n\n\n<li>Work with cross-location teams, team members, and stakeholders to establish and maintain consistent delivery.&nbsp;<\/li>\n\n\n\n<li>Manage projects, develop, and execute the project plan.&nbsp;<\/li>\n\n\n\n<li>Contribute to the development of project documentation, including flow charts, business process flow diagrams, requirements documents, SOPs, user manuals, and other relevant documentation.&nbsp;<\/li>\n\n\n\n<li>Propose solutions and improvements to enhance the quality of solutions and project delivery.&nbsp;<\/li>\n\n\n\n<li>Collaborate with other members of the development team to design, develop, test, and deploy solutions.&nbsp;<\/li>\n\n\n\n<li>Provide ongoing support and training for internal teams.&nbsp;<\/li>\n\n\n\n<li>Prepare weekly reports to track the project’s progress for the weekly project review with the client.&nbsp;<\/li>\n\n\n\n<li>Manage scrum artifacts and ceremonies.&nbsp;<\/li>\n\n\n\n<li>Perform other related duties as assigned.&nbsp;<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Business analyst requirements:<\/h2>\n\n\n\n<ul>\n<li>5+ years of experience in a client facing Business Analyst role. <\/li>\n\n\n\n<li>Familiarity with Agile Scrum practices, including story slicing, grooming, daily scrum, iteration planning, retrospective, and test-driven development.  &nbsp;<\/li>\n\n\n\n<li>Exceptional organizational, presentation, and communication skills, both verbal and written. &nbsp;<\/li>\n\n\n\n<li>Expertise in developing project documentation, including Business Requirements, Use Cases, and Functional Specifications. &nbsp;<\/li>\n\n\n\n<li>Demonstrated analytical, interpretive, and problem-solving.<\/li>\n\n\n\n<li>Ability to adapt to changing project requirements.&nbsp;<\/li>\n\n\n\n<li>Ability to handle multiple projects simultaneously and manage priorities to meet deadlines while maintaining consistently high-quality outcomes.  &nbsp;<\/li>\n\n\n\n<li>Demonstrated expertise in building and maintaining strong relationships with clients and stakeholders. &nbsp;<\/li>\n\n\n\n<li>Proven ability to collaborate with cross-functional teams, including developers, testers, and project managers, to achieve project goals. &nbsp;<\/li>\n\n\n\n<li>Business Analysis or Project Management certification would be an advantage.<\/li>\n\n\n\n<li>Education: Graduation from any stream, MBA\/PGDM with any specialization .<\/li>\n<\/ul>\n\n\n\n<p>​<\/p>\n","protected":false},"excerpt":{"rendered":"<p> Exp required: 5+ Years Job Description: As a key member of the project delivery team, the business analyst is responsible for delivering consistent and accelerated value to clients. The role involves conducting process discovery, gathering detailed requirements, developing business requirements documents, and ensuring the solution aligns with client needs.&nbsp; The ideal candidate will have business [&hellip;]<\/p>\n","protected":false},"author":1,"template":"","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"_links":{"self":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/16019"}],"collection":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings"}],"about":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/types\/awsm_job_openings"}],"author":[{"embeddable":true,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/users\/1"}],"version-history":[{"count":4,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/16019\/revisions"}],"predecessor-version":[{"id":19646,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/16019\/revisions\/19646"}],"wp:attachment":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/media?parent=16019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}