{"id":6602,"date":"2022-07-27T08:11:54","date_gmt":"2022-07-27T08:11:54","guid":{"rendered":"https:\/\/techladder.io\/?post_type=awsm_job_openings&#038;p=6602"},"modified":"2024-05-06T12:11:37","modified_gmt":"2024-05-06T12:11:37","slug":"net-full-stack-developer-lead","status":"publish","type":"awsm_job_openings","link":"https:\/\/techladder.io\/careers\/net-full-stack-developer-lead\/","title":{"rendered":". Net Full-Stack Developer Lead"},"content":{"rendered":"\n<p>Exp required: 10+ Years<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Roles and <strong>Responsibilities:<\/strong><\/strong><\/h2>\n\n\n\n<ul>\n<li> Lead and manage the application support team, providing guidance, mentorship, and technical expertise to ensure the timely resolution of incidents and service requests. <\/li>\n\n\n\n<li>Oversee the incident management process, coordinating the resolution of application-related issues. Implement and improve incident response procedures to minimize downtime. <\/li>\n\n\n\n<li>Establish and maintain service level agreements (SLAs) for application support. Monitor performance metrics, identify areas for improvement, and implement corrective actions. <\/li>\n\n\n\n<li>Drive continuous improvement initiatives within the application support function, optimizing processes, and implementing best practices to enhance the efficiency and effectiveness of support activities. <\/li>\n\n\n\n<li>Work closely with application development teams to facilitate seamless handover of applications from development to production. Provide insights and feedback to improve application performance and reliability. <\/li>\n\n\n\n<li>Conduct root cause analysis for major incidents, identify underlying issues, and collaborate with development teams to implement preventive measures. <\/li>\n\n\n\n<li>Participate in change management processes, reviewing and approving changes to production systems. Ensure that changes are implemented smoothly without impacting business operations. <\/li>\n\n\n\n<li>Take ownership of application support activities and ensure the smooth operation of critical systems. <\/li>\n\n\n\n<li>Coordinate and collaborate with onsite client teams and offshore dev teams to address code updates and enhancements. <\/li>\n\n\n\n<li>Review code changes and ensure adherence to coding standards, best practices, and release management processes. <\/li>\n\n\n\n<li>Act as the point of contact for the client regarding code deployment and production environment updates to existing applications in production. <\/li>\n\n\n\n<li>Collaborate with the development team to plan and prioritize code releases based on business requirements and priorities. <\/li>\n\n\n\n<li>Conduct regular code reviews to identify and address any potential issues or vulnerabilities. <\/li>\n\n\n\n<li>Perform troubleshooting and debugging of application issues to identify root causes and propose appropriate solutions. <\/li>\n\n\n\n<li>Collaborate with cross-functional teams, including developers, quality assurance, and infrastructure teams, to resolve issues and ensure effective incident management. <\/li>\n\n\n\n<li>Provide technical guidance and mentorship to Application Support team members, fostering a culture of collaboration and continuous improvement. <\/li>\n\n\n\n<li>Stay updated with industry trends and technologies related to application support and actively contribute to process enhancements and optimization. <\/li>\n\n\n\n<li>Communicate effectively with stakeholders, providing regular updates on support activities, issue resolution, and code deployment status. <\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong><strong>Qualifications:<\/strong><\/strong> <\/h2>\n\n\n\n<ul>\n<li>Bachelor’s Degree in Computer Science, Software Engineering, or a related field is preferred. <\/li>\n\n\n\n<li>10+ years of total experience. <\/li>\n\n\n\n<li>5+ years of experience in application support and maintenance, in a lead or senior role. <\/li>\n\n\n\n<li>Leadership skills with the ability to mentor and guide Application Support team members. <\/li>\n\n\n\n<li>Strong technical background in software development, with expertise in programming languages such as .Net, ASP.Net Core, C#, Web API, and JSON and front-end languages like Angular 10+, Node.js, JavaScript, HTML, CSS, RESTful Web Services and their core principles. <\/li>\n\n\n\n<li>Familiarity with code review processes, release management, and version control systems (e.g., Git, SVN). <\/li>\n\n\n\n<li>Working Knowledge on Azure CI\/CD pipelines <\/li>\n\n\n\n<li>2+ years of experience in Azure web apps development is Mandatory <\/li>\n\n\n\n<li>Proactive mindset with the ability to prioritize tasks and handle multiple responsibilities in a fast-paced environment. <\/li>\n\n\n\n<li>Familiarity with Agile principles and practices, scrum and tools like JIRA, ADO Boards, etc.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Exp required: 10+ Years Roles and Responsibilities: Qualifications: <\/p>\n","protected":false},"author":1,"template":"","meta":{"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"_links":{"self":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/6602"}],"collection":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings"}],"about":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/types\/awsm_job_openings"}],"author":[{"embeddable":true,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/users\/1"}],"version-history":[{"count":5,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/6602\/revisions"}],"predecessor-version":[{"id":19654,"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/awsm_job_openings\/6602\/revisions\/19654"}],"wp:attachment":[{"href":"https:\/\/techladder.io\/wp-json\/wp\/v2\/media?parent=6602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}